Revit 2026 API

# RebarCreateFromCurves(Document, RebarStyle, RebarBarType, Element, XYZ, IListCurve, BarTerminationsData, Boolean, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Rebar CreateFromCurves(
	Document doc,
	RebarStyle style,
	RebarBarType barType,
	Element host,
	XYZ norm,
	IList<Curve> curves,
	BarTerminationsData barTerminationsData,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```vb
Public Shared Function CreateFromCurves (
	doc As Document,
	style As RebarStyle,
	barType As RebarBarType,
	host As Element,
	norm As XYZ,
	curves As IList(Of Curve),
	barTerminationsData As BarTerminationsData,
	useExistingShapeIfPossible As Boolean,
	createNewShape As Boolean
) As Rebar
```
```cpp
public:
static Rebar^ CreateFromCurves(
	Document^ doc,
	RebarStyle style,
	RebarBarType^ barType,
	Element^ host,
	XYZ^ norm,
	IList<Curve^>^ curves,
	BarTerminationsData^ barTerminationsData,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```fsharp
static member CreateFromCurves :
        doc : Document *
        style : RebarStyle *
        barType : RebarBarType *
        host : Element *
        norm : XYZ *
        curves : IList<Curve> *
        barTerminationsData : BarTerminationsData *
        useExistingShapeIfPossible : bool *
        createNewShape : bool -> Rebar
```

#### Parameters

doc Document

style RebarStyle

barType RebarBarType

host Element

norm XYZ

curves IListCurve

barTerminationsData BarTerminationsData

useExistingShapeIfPossible Boolean

createNewShape Boolean

#### Return Value

Rebar

#### Reference

Rebar Class

CreateFromCurves Overload

Autodesk.Revit.DB.Structure Namespace